{
  "message": "Article retrieved successfully",
  "data": {
    "id": "article001",
    "title": "Understanding Anxiety: Symptoms and Solutions",
    "author": {
      "name": "Dr. Sarah Thompson",
      "id": "author001",
      "profile_image": "https://example.com/dr_sarah_thompson.jpg",
      "bio": "Dr. Sarah Thompson is a clinical psychologist with over 10 years of experience in mental health treatment, specializing in anxiety and stress management."
    },
    "metadata": {
      "publish_date": "2024-11-06T00:00:00Z",
      "last_updated": "2024-11-06T00:00:00Z",
      "tags": ["anxiety", "mental health", "stress management"],
      "category": "Mental Health",
      "reading_time": 7,
      "likes": 120,
      "views": 800,
      "mental_state": "anxiety",
      "image_link": "https://example.com/anxiety-image.jpg"
    },
    "content": [
      {
        "type": "header",
        "level": 1,
        "text": "What is Anxiety?"
      },
      {
        "type": "paragraph",
        "text": "Anxiety is a normal response to stress, but for some, it becomes chronic. It is a condition characterized by excessive worry, fear, and nervousness. While mild anxiety can help us stay alert, intense and persistent anxiety can interfere with daily life. In fact, anxiety disorders are the most common mental health issue in the United States, affecting millions of people each year."
      },
      {
        "type": "paragraph",
        "text": "Anxiety can be triggered by a variety of factors including personal experiences, genetics, or environmental influences. While everyone experiences anxiety from time to time, those with anxiety disorders may experience overwhelming feelings even in situations that are not particularly stressful."
      },
      {
        "type": "subheader",
        "level": 2,
        "text": "Common Symptoms of Anxiety"
      },
      {
        "type": "paragraph",
        "text": "Anxiety manifests in various ways. Common symptoms include constant worry, trouble concentrating, irritability, muscle tension, and sleep disturbances. For some, it may also cause physical symptoms like rapid heartbeat or dizziness. These symptoms can vary in intensity and frequency and may affect both the mind and body."
      },
      {
        "type": "paragraph",
        "text": "If left untreated, anxiety can have a significant impact on daily life. Individuals may find themselves avoiding situations that trigger anxiety, which can lead to isolation and a reduced quality of life. In extreme cases, anxiety can interfere with one's ability to work, attend social events, or even leave the house."
      },
      {
        "type": "image",
        "src": "https://example.com/anxiety-symptoms.jpg",
        "alt": "Infographic on anxiety symptoms"
      },
      {
        "type": "quote",
        "text": "\"Anxiety is not something to be ashamed of. It’s a human response to life’s pressures that can be managed with the right tools and support.\" - Dr. Sarah Thompson"
      },
      {
        "type": "subheader",
        "level": 2,
        "text": "Managing Anxiety"
      },
      {
        "type": "paragraph",
        "text": "Managing anxiety involves both lifestyle changes and professional help. Cognitive Behavioral Therapy (CBT) is highly effective for addressing negative thought patterns. Additionally, practices such as mindfulness, deep breathing exercises, and regular physical activity can help alleviate symptoms. For some, medications such as antidepressants or anxiolytics may also be recommended to manage symptoms."
      },
      {
        "type": "paragraph",
        "text": "In addition to traditional treatment methods, some individuals find relief in alternative therapies like acupuncture, aromatherapy, or yoga. These practices can complement more conventional treatments and help individuals manage anxiety holistically. It’s important to work with a mental health professional to find the right combination of treatments for each person."
      },
      {
        "type": "embed",
        "src": "https://www.youtube.com/embed/xyz123456",
        "alt": "Video on managing anxiety"
      }
    ]
  }
}
